#include<stdio.h>

//杨辉三角
 //    1                4  5-i-1
 //   1 1               3 
 //  1 2 1              2
 // 1 3 3 1             1
 //1 4 6 4 1            0 
//可以将其看做是这样的
//1
//11
//121 
//1331
//14641
//一条直角边 一个斜边都是1
//int main() {
//	int arr[5][5] = { 0 };
//	int i = 0;
//	for (i; i <5; i++) {
//		int j = 0;
//		for (j; j <= i; j++) {
//			if (i == j||j==0) 
//				arr[i][j] = 1;
//			if (i >= 2 && j >= 1) {
//				arr[i][j] = arr[i - 1][j - 1] + arr[i - 1][j];
//			}
//		 
//		}
//	}
//
//	for (i=0; i < 5; i++) {
//		int j = 0;
//		for (j = 0; j < 5 - i - 1; j++)
//		{
//			printf(" ");
//		}
//		for (j=0; j <=i; j++) {
//			printf("%d ", arr[i][j]);
//		}
//		printf("\n");
//	}
//}

//日本某地发生了一件谋杀案，警察通过排查确定杀人凶手必为4个嫌疑犯的一个。
//以下为4个嫌疑犯的供词 :
//A说：不是我。
//B说：是C。
//C说：是D。
//D说：C在胡说
//已知3个人说了真话，1个人说的是假话。
//现在请根据这些信息，写一个程序来确定到底谁是凶手。


//用三个人说真话，一个人说假话作为条件（0为假，1为真）；
//一共只有四种情况，A / B / C / D为凶手
//用凶手分别遍历ABCD，四者供词加在一起，只要等于3，就可以得到凶手了

//int main() {
//	char killer;
//	for (killer = 'A'; killer <= 'D'; killer++) {
//		if ((killer != 'A') + (killer == 'C') + (killer == 'D') + (killer != 'D') == 3) {
//			printf("killer is %c", killer);
//		}
//	}
//}